[{"title": "NASA's Perseverance Rover 100 Days Out", "preview": "Mark your calendars: The agency's latest rover has only about 8,640,000 seconds to go before it touches down on the Red Planet, becoming history's next Mars car."}, {"title": "NASA's Treasure Map for Water Ice on Mars", "preview": "A new study identifies frozen water just below the Martian surface, where astronauts could easily dig it up."}, {"title": "Two of a Space Kind: Apollo 12 and Mars 2020", "preview": "Apollo 12 and the upcoming Mars 2020 mission may be separated by half a century, but they share several goals unique in the annals of space exploration."}, {"title": "Follow NASA's Perseverance Rover in Real Time on Its Way to Mars", "preview": "A crisply rendered web application can show you where the agency's Mars 2020 mission is right now as it makes its way to the Red Planet for a Feb. 18, 2021, landing."}, {"title": "10.9 Million Names Now Aboard NASA's Perseverance Mars Rover", "preview": "As part of NASA's 'Send Your Name to Mars' campaign, they've been stenciled onto three microchips along with essays from NASA's 'Name the Rover' contest. Next stop: Mars."}, {"title": "NASA's Mars Perseverance Rover Passes Flight Readiness Review", "preview": "​The agency's Mars 2020 mission has one more big prelaunch review – the Launch Readiness Review, on July 27."}, {"title": "NASA to Hold Mars 2020 Perseverance Rover Launch Briefing", "preview": "Learn more about the agency's next Red Planet mission during a live event on June 17."}, {"title": "NASA Adds Return Sample Scientists to Mars 2020 Leadership Team", "preview": "The leadership council for Mars 2020 science added two new members who represent the interests of scientists destined to handle and study the first samples from Red Planet."}, {"title": "3 Things We've Learned From NASA's Mars InSight ", "preview": "Scientists are finding new mysteries since the geophysics mission landed two years ago."}, {"title": "5 Hidden Gems Are Riding Aboard NASA's Perseverance Rover", "preview": "The symbols, mottos, and small objects added to the agency's newest Mars rover serve a variety of purposes, from functional to decorative."}, {"title": "NASA's Perseverance Rover Attached to Atlas V Rocket", "preview": "Ready for its launch later in the month, the Mars-bound rover will touch terra firma no more."}, {"title": "NASA's Mars 2020 Will Hunt for Microscopic Fossils", "preview": "A new paper identifies a ring of minerals at the rover's landing site that are ideal for fossilizing microbial life."}, {"title": "The Detective Aboard NASA's Perseverance Rover", "preview": "An instrument called SHERLOC will, with the help of its partner WATSON, hunt for signs of ancient life by detecting organic molecules and minerals."}, {"title": "Newfound Martian Aurora Actually the Most Common; Sheds Light on Mars' Changing Climate", "preview": "A type of Martian aurora first identified by NASA’s MAVEN spacecraft in 2016 is actually the most common form of aurora occurring on the Red Planet, according to new results from the mission."}, {"title": "Air Deliveries Bring NASA's Perseverance Mars Rover Closer to Launch", "preview": "A NASA Wallops Flight Facility cargo plane transported more than two tons of equipment — including the rover's sample collection tubes — to Florida for this summer's liftoff."}]